Revit 2026 API

# UIControlledApplicationDockableFrameVisibilityChanged Event

---

Subscribe to GenericDockableFrame showing or hiding event to be notified when Revit GenericDockableFrame is showing or hiding.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<DockableFrameVisibilityChangedEventArgs> DockableFrameVisibilityChanged
```
```vb
Public Event DockableFrameVisibilityChanged As EventHandler(Of DockableFrameVisibilityChangedEventArgs)
```
```cpp
public:
 event EventHandler<DockableFrameVisibilityChangedEventArgs^>^ DockableFrameVisibilityChanged {
	void add (EventHandler<DockableFrameVisibilityChangedEventArgs^>^ value);
	void remove (EventHandler<DockableFrameVisibilityChangedEventArgs^>^ value);
}
```
```fsharp
member DockableFrameVisibilityChanged : IEvent<EventHandler<DockableFrameVisibilityChangedEventArgs>,
    DockableFrameVisibilityChangedEventArgs>
```

#### Value

EventHandlerDockableFrameVisibilityChangedEventArgs

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace